app/Controllers/Auth.php

    public function login()
    {
        $username = trim((string) $this->request->getPost('username'));
        $password = (string) $this->request->getPost('password');
        $user = $username !== '' && strlen($username) <= 50 && $password !== ''
            ? (new UserModel())->where('username', $username)->first()
---
SELECT *
FROM `users`
WHERE `username` = 'admin01'
 LIMIT 1