app/Controllers/Customers.php

    public function index(): string
    {
        $customerModel = new CustomerModel();

        $data = [
            'title'     => 'Customer Accounts',
            'customers' => $customerModel->findAll(),
---
SELECT *
FROM `customers`

    public function create()
    {
        $data = [
            'full_name' => trim((string) $this->request->getPost('full_name')),
            'email'     => trim((string) $this->request->getPost('email')),
            'phone'     => trim((string) $this->request->getPost('phone')),
        ];

        $rules = [
            'full_name' => 'required|max_length[100]',
            'email'     => 'required|valid_email|max_length[100]',
            'phone'     => 'permit_empty|max_length[20]',
        ];

        if (! $this->validateData($data, $rules)) {
            return redirect()->back()->withInput();
        }

        $data['created_at'] = date('Y-m-d H:i:s');

        $model = new CustomerModel();

        if ($model->insert($data) === false) {
---
INSERT INTO `customers` (`full_name`, `email`, `phone`, `created_at`) VALUES ('Tracy Reznik', 'mechanic@gmail.com', '0956-129-0054', '2026-10-02 12:28:34')

    public function edit(int $id)
    {
        $customer = (new CustomerModel())->find($id);
---
SELECT *
FROM `customers`
WHERE `customers`.`id` = 5

    public function update(int $id)
    {
        $model = new CustomerModel();
        $customer = $model->find($id);

        if ($customer === null) {
            throw PageNotFoundException::forPageNotFound();
        }

        $data = [
            'full_name' => trim((string) $this->request->getPost('full_name')),
            'email'     => trim((string) $this->request->getPost('email')),
            'phone'     => trim((string) $this->request->getPost('phone')),
        ];

        $rules = [
            'full_name' => 'required|max_length[100]',
            'email'     => 'required|valid_email|max_length[100]',
            'phone'     => 'permit_empty|max_length[20]',
        ];

        if (! $this->validateData($data, $rules)) {
            return redirect()->back()->withInput();
        }

        if ($model->update($id, $data) === false) {
---
SELECT *
FROM `customers`
WHERE `customers`.`id` = 4
UPDATE `customers` SET `full_name` = 'Evelyn Mora', `email` = 'farolady@gmail.com', `phone` = '0920-456-7890'
WHERE `customers`.`id` IN (4)