app/Controllers/Users.php

    public function index()
    {
        $model = new UserModel();

        return view('pos/users', [
            'title' => 'User Accounts',
            'users' => $model->select('id, username, full_name, avatar, created_at')->findAll(),
---
SELECT `id`, `username`, `full_name`, `avatar`, `created_at`
FROM `users`

    public function edit(int $id)
    {
        $user = (new UserModel())->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 4