app/Controllers/Users.php

    public function index()
    {
        $model = new UserModel();

        return view('pos/users', [
            'title' => 'User Accounts',
            'users' => $model->findAll(),
---
SELECT *
FROM `users`